marcimarc98/PathRacer_Software/Empfaenger/Fahrzeugsteuerung_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOF
#define BATTERY_ADC_Pin GPIO_PIN_3
#define BATTERY_ADC_GPIO_Port GPIOA
#define BATTERY_TEMP_ADC_Pin GPIO_PIN_1
#define BATTERY_TEMP_ADC_GPIO_Port GPIOA
#define CRSF_TX_Pin GPIO_PIN_9
#define CRSF_TX_GPIO_Port GPIOA
#define CRSF_RX_Pin GPIO_PIN_10
#define CRSF_RX_GPIO_Port GPIOA
#define SERVO_PWM_Pin GPIO_PIN_6
#define SERVO_PWM_GPIO_Port GPIOA
#define ESC_PWM_Pin GPIO_PIN_7
#define ESC_PWM_GPIO_Port GPIOA
#define CAMERA_PWM_Pin GPIO_PIN_0
#define CAMERA_PWM_GPIO_Port GPIOA
#define CAMERA_PAN_PWM_Pin GPIO_PIN_8
#define CAMERA_PAN_PWM_GPIO_Port GPIOA
#define DIFF_FRONT_PWM_Pin GPIO_PIN_0
#define DIFF_FRONT_PWM_GPIO_Port GPIOB
#define DIFF_REAR_PWM_Pin GPIO_PIN_1
#define DIFF_REAR_PWM_GPIO_Port GPIOB
#define LIGHT_MAIN_Pin GPIO_PIN_4
#define LIGHT_MAIN_GPIO_Port GPIOB
#define LIGHT_BRAKE_Pin GPIO_PIN_5
#define LIGHT_BRAKE_GPIO_Port GPIOB
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
